app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "where does this go?"], ["list_id", 1], ["created_at", "2018-05-04 23:21:21.950983"], ["updated_at", "2018-05-04 23:21:21.950983"]]
---
  def create

  	@list = List.find_by(id: params[:list_id])
  	@item = @list.items.build(item_params)

    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 1], ["updated_at", "2018-05-05 15:14:43.652641"], ["id", 2]]
---
  def update
    # raise params.inspect
    @item = Item.find(params[:id])
    @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 3]]
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy