app/controllers/lists_controller.rb

  def index
    @list = List.new
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def show
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @list = List.new(list_params)
    if @list.save

      redirect_to list_url(@list)
    else
      @lists = List.all
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Reading List"], ["created_at", "2018-05-04 23:22:53.812746"], ["updated_at", "2018-05-04 23:22:53.812746"]]
SELECT "lists".* FROM "lists"

  def edit
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]