app/controllers/sessions_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "ironviralmedia@gmail.com"]]
---
	def create
		if auth
			@user = User.find_or_create_by_omniauth(auth)
			session[:user_id] = @user.id

			redirect_to root_path
		else

			@user = User.find_by(email: params[:email])