app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "j@j.com"], ["created_at", "2018-05-07 17:11:35.107599"], ["updated_at", "2018-05-07 17:11:35.107599"]]
---
  def create
  	@user = User.new(user_params)
  	if @user.save